# Dictionaries 
- assign key to a value

In [1]:
my_dict = {'key1':'value1','Key2':'value2','key3':'value3','Key4':'value4'}

In [4]:
list1 = ['value1','value2','value3','value4']

In [5]:
list1[0]

'value1'

In [9]:
my_dict['Key2']

'value2'

In [10]:
# Create dictionary emp: 
# keys are name, age, designation 
# value are Srikanth, 27, DS
emp = {'name':'Srikanth','age':27,'Designation':'DS'}

In [11]:
emp['name']

'Srikanth'

In [13]:
emp['Designation']

'DS'

In [14]:
emp

{'Designation': 'DS', 'age': 27, 'name': 'Srikanth'}

# methods

In [15]:
emp.items()

dict_items([('name', 'Srikanth'), ('age', 27), ('Designation', 'DS')])

In [16]:
emp.keys() # this will return keys

dict_keys(['name', 'age', 'Designation'])

In [17]:
emp.values() # this will return values

dict_values(['Srikanth', 27, 'DS'])

In [18]:
emp.pop('Designation') # shift + tab

'DS'

In [19]:
emp

{'age': 27, 'name': 'Srikanth'}

In [21]:
emp.update({'Sal':'xxxx'})

In [22]:
emp

{'Sal': 'xxxx', 'age': 27, 'name': 'Srikanth'}

In [23]:
# 
emp = {'Name':['Srikanth','Raghuram','Ram'],'Age':[27,25,26],
       'Designation':['DS','DC','JDS']}

In [24]:
emp

{'Age': [27, 25, 26],
 'Designation': ['DS', 'DC', 'JDS'],
 'Name': ['Srikanth', 'Raghuram', 'Ram']}

In [25]:
import pandas as pd

In [26]:
table = pd.DataFrame(emp)
table

   Age Designation      Name
0   27          DS  Srikanth
1   25          DC  Raghuram
2   26         JDS       Ram

In [27]:
# create column salary 
emp.update({'Salary':[5000,70000,100000]})

In [28]:
emp

{'Age': [27, 25, 26],
 'Designation': ['DS', 'DC', 'JDS'],
 'Name': ['Srikanth', 'Raghuram', 'Ram'],
 'Salary': [5000, 70000, 100000]}

In [29]:
pd.DataFrame(emp)

   Age Designation      Name  Salary
0   27          DS  Srikanth    5000
1   25          DC  Raghuram   70000
2   26         JDS       Ram  100000

In [31]:
l1 = emp['Age']

In [32]:
l1.append(25)

In [33]:
emp['Age'] = l1

In [34]:
emp

{'Age': [27, 25, 26, 25],
 'Designation': ['DS', 'DC', 'JDS'],
 'Name': ['Srikanth', 'Raghuram', 'Ram'],
 'Salary': [5000, 70000, 100000]}